In [1]:
import pandas as pd
import numpy as np

In [2]:
data =  {'eng':[10,30,50,70],
         'kor':[20,40,60,80],
         'math':[90,50,20,70]}
df = pd.DataFrame(data,index=['a','b','c','d'])
df

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20
d   70   80    70

In [3]:
# df['컬럼명']
# df['eng'].sum()
df['eng']

a    10
b    30
c    50
d    70
Name: eng, dtype: int64

In [4]:
df.eng#df['eng']

a    10
b    30
c    50
d    70
Name: eng, dtype: int64

In [5]:
df[ ['eng', 'math'] ]

   eng  math
a   10    90
b   30    50
c   50    20
d   70    70

In [6]:
df[['eng']]

   eng
a   10
b   30
c   50
d   70

In [7]:
#슬라이싱(row(index))
df[0:3]

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20

In [8]:
df['a':'c']

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20

In [9]:
#df.iloc[Obase인덱스, Obase컬럼]
df.iloc[0]

eng     10
kor     20
math    90
Name: a, dtype: int64

In [10]:
df.iloc[1]

eng     30
kor     40
math    50
Name: b, dtype: int64

In [11]:
df.iloc[0,0]

10

In [12]:
df.iloc[1:]

   eng  kor  math
b   30   40    50
c   50   60    20
d   70   80    70

In [14]:
df.iloc[1:, 1:]

   kor  math
b   40    50
c   60    20
d   80    70

In [16]:
df.iloc[[0,2,3], [0,2]]

   eng  math
a   10    90
c   50    20
d   70    70

In [17]:
#df.loc[부여된인덱스, 부여된컬럼]
df.loc['a']

eng     10
kor     20
math    90
Name: a, dtype: int64

In [18]:
df.loc['b':]

   eng  kor  math
b   30   40    50
c   50   60    20
d   70   80    70

In [19]:
df.loc['a','eng']

10

In [20]:
df.loc['b':,'kor':]

   kor  math
b   40    50
c   60    20
d   80    70

In [22]:
df.loc[['b','d'],['kor','math']]

   kor  math
b   40    50
d   80    70

In [13]:
df

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20
d   70   80    70